#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mdata.aws_vpc.selected: Reading...[0m[0m
[0m[1mdata.aws_ami.ubuntu: Reading...[0m[0m
[0m[1mdata.aws_ami.ubuntu: Read complete after 0s [id=ami-0e783882a19958fff][0m
[0m[1mdata.aws_vpc.selected: Read complete after 1s [id=vpc-04adbc006871eed44][0m
[0m[1maws_instance.shared_web: Refreshing state... [id=i-06f3dc39e2156218c][0m
[0m[1maws_eip.shared_web: Refreshing state... [id=eipalloc-05ac0c945fbec8074][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # aws_instance.shared_web[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_instance" "shared_web" {
        [1m[0mid[0m[0m                                   = "i-06f3dc39e2156218c"
        [1m[0mtags[0m[0m                                 = {
            "Application"        = "shared.web"
            "Environment"        = "prod"
            "ManagedByTerraform" = "True"
            "Name"               = "shared-services-prod-webserver"
        }
      [33m~[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [31m-[0m [0m"sg-05ccd624046be748b",
        ] [33m->[0m [0m(known after apply)
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (8 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_security_group.internet-access[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "internet-access" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "allow ssh on 22 + http/https on port 80/443"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 22
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 22
            },
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 443
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 443
            },
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 80
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 80
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "shared-services-prod-internet-access"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = "vpc-04adbc006871eed44"
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>